cf_billing/Documents/энргРегистрацияОбъемовПотребленияПриборовУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРегистрацияОбъемовПотребленияПриборовУчетаМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныеОбъемыПотребленияМКД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасовВОтчетномПериоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасовШтатнойРаботыПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияКомУчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасовРаботыТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасовШТИзмененоПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьПоказания</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВладельцыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВладельцыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПриборыТочекМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПриборыТочекМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидыДифференцированностиПриборовУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидыДифференцированностиПриборовУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргРегистрацияОбъемовПотребленияПриборовУчетаМКД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
	КонецЕсли;
	
	КонецПериодаНачисления = КонецДня(ГраницыОтчетногоПериода(Объект.Организация, Объект.ПериодНачисления).ЗавершениеОП);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли;
	
	КонецПериодаНачисления = КонецДня(ГраницыОтчетногоПериода(Объект.Организация, Объект.ПериодНачисления).ЗавершениеОП);
	
	ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииСервер();
	ОрганизацияПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация); 		
	КонецЕсли;
	
	ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
КонецПроцедуры

&НаКлиенте
Процедура МКДПриИзменении(Элемент)
	МКДПриИзмененииНаСервере();
	ПосчитатьКоличествоЧасовВПериоде(Объект.Организация, Объект.ПериодНачисления);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаКоличествоЧасовШтатнойРаботыПУПриИзменении(Элемент)
	ТекСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	ТекСтрока.КоличествоЧасовШТИзмененоПользователем = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаОбъемПриИзменении(Элемент)
	ТекСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	ТекСтрока.ЕстьПоказания = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаОбъемОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТекСтрока.ЕстьПоказания = Ложь;
		ТекСтрока.Объем = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ТекИдентификатор 	= "";
	Дубль				= Неопределено;
	ЗаполнитьДанныеДоговораСервер(ТекИдентификатор,Дубль);
	Если не Дубль = Неопределено Тогда
		ДопПараметры	= Новый Структура;
		ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
		ДопПараметры.Вставить("ТЧ", 			"ТочкиУчета");
		ДопПараметры.Вставить("ТекСтрока", 		ТекИдентификатор);
		ПоказанияУжеВведеныВопрос(ДопПараметры);			
	КонецЕсли;		
	Если НЕ ТекИдентификатор = "" Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ТочкиУчета;
		Элементы.ТочкиУчета.ТекущаяСтрока = ТекИдентификатор;
		Элементы.ТочкиУчета.ТекущийЭлемент = Элементы.ТочкиУчетаОбъем; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧасыШтатнойРаботы(Команда)
	Для каждого стр из Объект.ТочкиУчета Цикл
		Если Не стр.КоличествоЧасовШТИзмененоПользователем Тогда
			стр.КоличествоЧасовШтатнойРаботыПУ = стр.КоличествоЧасовРаботыТУ;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКМКД(Команда)
	Элементы.ТочкиУчета.ОтборСтрок = Новый ФиксированнаяСтруктура();
	СтруктураОтбора = Новый Структура();
	Если ЗначениеЗаполнено(МКД) Тогда
		СтруктураОтбора.Вставить("МКД", МКД);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТочкаУчета) Тогда
		СтруктураОтбора.Вставить("МКД", МКД);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Услуга) Тогда
		СтруктураОтбора.Вставить("Услуга", Услуга);
	КонецЕсли;
	Элементы.ТочкиУчета.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтбор(Команда)
	Элементы.ТочкиУчета.ОтборСтрок = Новый ФиксированнаяСтруктура();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РайонПриИзмененииСервер()
	Объект.Организация = Объект.Район.Организация;	
КонецПроцедуры

&НаСервере
Процедура МКДПриИзмененииНаСервере()
	Объект.Район = МКД.Район;
	Объект.Организация = МКД.Организация;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияУжеВведеныВопрос(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросПереходаКСтроке",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Объёмы уже введены. Перейти к строке?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПереходаКСтроке(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ПерейтиКСтроке(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСтроке(ДополнительныеПараметры)
	Элементы[ДополнительныеПараметры.ТЧ].ТекущаяСтрока = ДополнительныеПараметры.ТекСтрока;
	Элементы[ДополнительныеПараметры.ТЧ].ТекущийЭлемент = Элементы[ДополнительныеПараметры.ТЧ + "Объем"];	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер(ТекИдентификатор,Дубль)
	
	Результат 								= ДействующиеПриборыУчетаМКД(Объект.Дата,Объект.Организация,Объект.Район,МКД,ТочкаУчета,Услуга); 
	Выборка  								= Результат.выбрать();
	
	ТЧТочки = Объект.ТочкиУчета;
	
	Пока Выборка.следующий() цикл
		НовСтр = ТЧТочки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
		НовСтр.МКД = МКД;
		НовСтр.КоличествоЧасовШтатнойРаботыПУ = Выборка.КоличествоЧасовРаботыТУ;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДействующиеПриборыУчетаМКД(Период,Организация,Район,МКД,ТочкаУчета = Неопределено, Услуга = Неопределено)  
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(объект.Организация,Объект.Район,Объект.ПериодНачисления,Ложь);
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Период",					Новый Граница(Период,ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Район",					Район);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("МКД",					МКД);
	Запрос.УстановитьПараметр("НачалоОП",				ГраницыПериода.НачалоОП);
	Запрос.УстановитьПараметр("ЗавершениеОП",			ГраницыПериода.ЗавершениеОП);
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ АктивныеТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И МКД = &МКД
	|				И Район = &Район) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|	И энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета = &ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВладельцыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ТочкиУчетаМКД
	|ИЗ
	|	РегистрСведений.энргВладельцыТочекУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						АктивныеТочкиУчетаМКД.ТочкаУчета
	|					ИЗ
	|						АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД)) КАК энргВладельцыТочекУчетаСрезПоследних
	|ГДЕ
	|	энргВладельцыТочекУчетаСрезПоследних.АбонентВладелец = &МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеТочкиУчетаМКД.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ДействующиеТочкиУчета
	|ИЗ
	|	АктивныеТочкиУчетаМКД КАК АктивныеТочкиУчетаМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиУчетаМКД КАК ТочкиУчетаМКД
	|		ПО АктивныеТочкиУчетаМКД.ТочкаУчета = ТочкиУчетаМКД.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПриборыТочекМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыТочекМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыТочекМКД
	|ИЗ
	|	РегистрСведений.энргПриборыТочекМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргПриборыТочекМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ПриборыТочекМКД.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ПриборыДействующихТочекМКД
	|ИЗ
	|	ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриборыТочекМКД КАК ПриборыТочекМКД
	|		ПО ДействующиеТочкиУчета.ТочкаУчета = ПриборыТочекМКД.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВведенныеПриборыМКД
	|ИЗ
	|	РегистрСведений.энргСостояниеПриборовМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргСостояниеПриборовМКДСрезПоследних
	|ГДЕ
	|	энргСостояниеПриборовМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиТочекУчетаМКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|		ВЫБОР
	|			КОГДА энргУслугиТочекУчетаМКДСрезПоследних.Услуга.СоставнаяУслуга
	|				ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
	|			ИНАЧЕ энргУслугиТочекУчетаМКДСрезПоследних.Услуга
	|		КОНЕЦ КАК Услуга
	|	ИЗ
	|		РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД) КАК энргУслугиТочекУчетаМКДСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|			ПО энргУслугиТочекУчетаМКДСрезПоследних.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|				И (энргУслугиТочекУчетаМКДСрезПоследних.Услуга.СоставнаяУслуга)) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Услуга = &Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПриборыУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ТипИзмерителя КАК ТипИзмерителя,
	|	энргПриборыУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргПриборыУзловУчетаМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ВТ_ПриборыУзловУчета
	|ИЗ
	|	РегистрСведений.энргПриборыУзловУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И (ТочкаУчета, УзелУчета) В
	|					(ВЫБРАТЬ
	|						ВведенныеПриборыМКД.ТочкаУчета КАК ТочкаУчета,
	|						ВведенныеПриборыМКД.ПриборУчета КАК ПриборУчета
	|					ИЗ
	|						ВведенныеПриборыМКД КАК ВведенныеПриборыМКД)) КАК энргПриборыУзловУчетаМКДСрезПоследних
	|ГДЕ
	|	энргПриборыУзловУчетаМКДСрезПоследних.ПриборУчета.РегистрируетОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.УзелУчета КАК УзелУчета,
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВТ_АктивныеПриборыУзловУчета
	|ИЗ
	|	ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеПриборовУзловУчетаМКД.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Район = &Район
	|					И МКД = &МКД
	|					И (ТочкаУчета, УзелУчета, ТипИзмерителя, ПриборУчета) В
	|						(ВЫБРАТЬ
	|							ВТ_ПриборыУзловУчета.ТочкаУчета КАК ТочкаУчета,
	|							ВТ_ПриборыУзловУчета.УзелУчета КАК УзелУчета,
	|							ВТ_ПриборыУзловУчета.ТипИзмерителя КАК ТипИзмерителя,
	|							ВТ_ПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|						ИЗ
	|							ВТ_ПриборыУзловУчета КАК ВТ_ПриборыУзловУчета)) КАК энргСостояниеПриборовУзловУчетаМКДСрезПоследних
	|		ПО ВТ_ПриборыУзловУчета.ТочкаУчета = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТочкаУчета
	|			И ВТ_ПриборыУзловУчета.УзелУчета = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.УзелУчета
	|			И ВТ_ПриборыУзловУчета.ТипИзмерителя = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ТипИзмерителя
	|			И ВТ_ПриборыУзловУчета.ПриборУчета = энргСостояниеПриборовУзловУчетаМКДСрезПоследних.ПриборУчета
	|ГДЕ
	|	энргСостояниеПриборовУзловУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.Шкала КАК Шкала,
	|	энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ПОМЕСТИТЬ ВидыДифференцированностиТочекУчетаМКД
	|ИЗ
	|	РегистрСведений.энргВидыДифференцированностиПриборовУчетаМКД.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргВидыДифференцированностиПриборовУчетаМКДСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВложенныйЗапрос.УзелУчета КАК УзелУчета
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|		ВложенныйЗапрос.УзелУчета КАК УзелУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|			ВложенныйЗапрос.УзелУчета КАК УзелУчета,
	|			ВТ_АктивныеПриборыУзловУчета.ПриборУчета КАК ПриборУчета
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ПриборыДействующихТочекМКД.ТочкаУчета КАК ТочкаУчета,
	|				ПриборыДействующихТочекМКД.ПриборУчета КАК УзелУчета
	|			ИЗ
	|				ПриборыДействующихТочекМКД КАК ПриборыДействующихТочекМКД
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВведенныеПриборыМКД КАК ВведенныеПриборы
	|					ПО ПриборыДействующихТочекМКД.ПриборУчета = ВведенныеПриборы.ПриборУчета
	|						И ПриборыДействующихТочекМКД.ТочкаУчета = ВведенныеПриборы.ТочкаУчета) КАК ВложенныйЗапрос
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктивныеПриборыУзловУчета КАК ВТ_АктивныеПриборыУзловУчета
	|				ПО ВложенныйЗапрос.ТочкаУчета = ВТ_АктивныеПриборыУзловУчета.ТочкаУчета
	|					И ВложенныйЗапрос.УзелУчета = ВТ_АктивныеПриборыУзловУчета.УзелУчета) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО ВложенныйЗапрос.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.ТочкаУчета КАК ТочкаУчета,
	|	ТЗ.Услуга КАК Услуга,
	|	ТЗ.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ УжеЕсть
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|	Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|	Вложенныйзапрос.Шкала КАК Шкала,
	|	Вложенныйзапрос.Услуга КАК Услуга,
	|	Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	Вложенныйзапрос.УзелУчета КАК УзелУчета
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|		ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|		ДанныеПоПриборам.Шкала КАК Шкала,
	|		ЕСТЬNULL(УслугиТочекУчетаМКД.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|		ЕСТЬNULL(ВидыДифференцированностиТочекУчетаМКД.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности,
	|		ДанныеПоПриборам.УзелУчета КАК УзелУчета
	|	ИЗ
	|		ДанныеПоПриборам КАК ДанныеПоПриборам
	|			ЛЕВОЕ СОЕДИНЕНИЕ УслугиТочекУчетаМКД КАК УслугиТочекУчетаМКД
	|			ПО ДанныеПоПриборам.ТочкаУчета = УслугиТочекУчетаМКД.ТочкаУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВидыДифференцированностиТочекУчетаМКД КАК ВидыДифференцированностиТочекУчетаМКД
	|			ПО ДанныеПоПриборам.ПриборУчета = ВидыДифференцированностиТочекУчетаМКД.ПриборУчета
	|				И ДанныеПоПриборам.Шкала = ВидыДифференцированностиТочекУчетаМКД.Шкала) КАК Вложенныйзапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргАктивностьТочекУчетаМКДСрезПоследних.Состояние КАК Состояние,
	|	&НачалоОП КАК Период
	|ПОМЕСТИТЬ РасчетВремениРаботыТУНачало
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(
	|			&НачалоОП,
	|			Организация = &Организация
	|				И МКД = &МКД
	|				И Район = &Район) КАК энргАктивностьТочекУчетаМКДСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Итог КАК Итог
	|		ПО энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета = Итог.ТочкаУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	энргАктивностьТочекУчетаМКД.ТочкаУчета,
	|	энргАктивностьТочекУчетаМКД.Состояние,
	|	энргАктивностьТочекУчетаМКД.Период
	|ИЗ
	|	Итог КАК Итог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчетаМКД КАК энргАктивностьТочекУчетаМКД
	|		ПО Итог.ТочкаУчета = энргАктивностьТочекУчетаМКД.ТочкаУчета
	|ГДЕ
	|	энргАктивностьТочекУчетаМКД.Организация = &Организация
	|	И энргАктивностьТочекУчетаМКД.Район = &Район
	|	И энргАктивностьТочекУчетаМКД.МКД = &МКД
	|	И энргАктивностьТочекУчетаМКД.Период > &НачалоОП
	|	И энргАктивностьТочекУчетаМКД.Период <= &ЗавершениеОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетВремениРаботыТУНачало.ТочкаУчета КАК ТочкаУчета,
	|	РасчетВремениРаботыТУНачало.Состояние КАК Состояние,
	|	РасчетВремениРаботыТУНачало.Период КАК Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетВремениРаботыТУНачало1.Период) КАК Позиция
	|ПОМЕСТИТЬ РасчетВремениРаботыТУСтабПер
	|ИЗ
	|	РасчетВремениРаботыТУНачало КАК РасчетВремениРаботыТУНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетВремениРаботыТУНачало КАК РасчетВремениРаботыТУНачало1
	|		ПО РасчетВремениРаботыТУНачало.ТочкаУчета = РасчетВремениРаботыТУНачало1.ТочкаУчета
	|			И РасчетВремениРаботыТУНачало.Период > РасчетВремениРаботыТУНачало1.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетВремениРаботыТУНачало.ТочкаУчета,
	|	РасчетВремениРаботыТУНачало.Состояние,
	|	РасчетВремениРаботыТУНачало.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетВремениРаботыТУСтабПер.ТочкаУчета КАК ТочкаУчета,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетВремениРаботыТУСтабПер1.ТочкаУчета ЕСТЬ NULL
	|				ТОГДА РАЗНОСТЬДАТ(РасчетВремениРаботыТУСтабПер.Период, &ЗавершениеОП, ЧАС)
	|			ИНАЧЕ РАЗНОСТЬДАТ(РасчетВремениРаботыТУСтабПер.Период, РасчетВремениРаботыТУСтабПер1.Период, ЧАС)
	|		КОНЕЦ) КАК КоличествоЧасовРаботыТУ
	|ПОМЕСТИТЬ РасчетВремениРаботыТУИтог
	|ИЗ
	|	РасчетВремениРаботыТУСтабПер КАК РасчетВремениРаботыТУСтабПер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетВремениРаботыТУСтабПер КАК РасчетВремениРаботыТУСтабПер1
	|		ПО РасчетВремениРаботыТУСтабПер.ТочкаУчета = РасчетВремениРаботыТУСтабПер1.ТочкаУчета
	|			И (РасчетВремениРаботыТУСтабПер.Позиция = РасчетВремениРаботыТУСтабПер1.Позиция - 1)
	|ГДЕ
	|	РасчетВремениРаботыТУСтабПер.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетВремениРаботыТУСтабПер.ТочкаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.ТочкаУчета КАК ТочкаУчета,
	|	ВЫБОР
	|		КОГДА Итог.УзелУчета ЕСТЬ NULL
	|			ТОГДА Итог.ПриборУчета
	|		ИНАЧЕ Итог.УзелУчета
	|	КОНЕЦ КАК ПриборУчета,
	|	Итог.Услуга КАК Услуга,
	|	Итог.ВидДифференцированности КАК ВидДифференцированности,
	|	энргПоставщикиУслугМКДСрезПоследних.Поставщик КАК Поставщик,
	|	ВЫБОР
	|		КОГДА РасчетВремениРаботыТУИтог.КоличествоЧасовРаботыТУ ЕСТЬ NULL
	|			ТОГДА РАЗНОСТЬДАТ(&НачалоОП, &ЗавершениеОП, ЧАС)
	|		ИНАЧЕ РасчетВремениРаботыТУИтог.КоличествоЧасовРаботыТУ
	|	КОНЕЦ КАК КоличествоЧасовРаботыТУ
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПоставщикиУслугМКД.СрезПоследних(&Период, Район = &Район) КАК энргПоставщикиУслугМКДСрезПоследних
	|		ПО Итог.ТочкаУчета = энргПоставщикиУслугМКДСрезПоследних.ТочкаУчета
	|			И Итог.Услуга = энргПоставщикиУслугМКДСрезПоследних.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетВремениРаботыТУИтог КАК РасчетВремениРаботыТУИтог
	|		ПО Итог.ТочкаУчета = РасчетВремениРаботыТУИтог.ТочкаУчета
	|ГДЕ
	|	НЕ (Итог.ТочкаУчета, Итог.Услуга, ВЫБОР
	|				КОГДА Итог.УзелУчета ЕСТЬ NULL
	|					ТОГДА Итог.ПриборУчета
	|				ИНАЧЕ Итог.УзелУчета
	|			КОНЕЦ) В
	|				(ВЫБРАТЬ
	|					УжеЕсть.ТочкаУчета КАК ТочкаУчета,
	|					УжеЕсть.Услуга КАК Услуга,
	|					УжеЕсть.ПриборУчета КАК ПриборУчета
	|				ИЗ
	|					УжеЕсть КАК УжеЕсть)";
	
	
	Запрос.УстановитьПараметр("ТЗ",	Объект.ТочкиУчета.Выгрузить(,"ТочкаУчета,Услуга,ПриборУчета"));
	Если ЗначениеЗаполнено(ТочкаУчета) Тогда
		Запрос.УстановитьПараметр("ТочкаУчета",	ТочкаУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета = &ТочкаУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Услуга) Тогда
		Запрос.УстановитьПараметр("Услуга",	Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВложенныйЗапрос.Услуга = &Услуга", "Истина");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	Возврат Результат;
КонецФункции


&НаСервере
Процедура ПосчитатьКоличествоЧасовВПериоде(ТекОрганизация, ПериодНачисления)
	//Выборка = ГраницыОтчетногоПериода(ТекОрганизация, ПериодНачисления);
	
	Если ТекОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда	
		ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(ТекОрганизация,Объект.Район,ПериодНачисления,Ложь);
		Объект.КоличествоЧасовВОтчетномПериоде = (ГраницыПериода.ЗавершениеОП - ГраницыПериода.НачалоОП) / 3600;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ГраницыОтчетногоПериода(Организация, ПериодНачисления)
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.Текст ="ВЫБРАТЬ
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ), ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеПредыдущего, энргДеньЗавершенияРасчетногоПериода.Значение)) КАК НачалоОП,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ПериодНачисления, ДЕНЬ, ЕСТЬNULL(ВложенныйЗапрос.ЗавершениеТекущего, энргДеньЗавершенияРасчетногоПериода.Значение)), СЕКУНДА, -1) КАК ЗавершениеОП
	|ИЗ
	|	(ВЫБРАТЬ
	|		NULL КАК ЗавершениеПредыдущего,
	|		энргДатыОтчетногоПериоды.Завершение КАК ЗавершениеТекущего
	|	ИЗ
	|		РегистрСведений.энргДатыОтчетногоПериоды КАК энргДатыОтчетногоПериоды
	|	ГДЕ
	|		энргДатыОтчетногоПериоды.ПериодНачисления = &ПериодНачисления
	|		И энргДатыОтчетногоПериоды.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		энргДатыОтчетногоПериоды.Завершение,
	|		NULL
	|	ИЗ
	|		РегистрСведений.энргДатыОтчетногоПериоды КАК энргДатыОтчетногоПериоды
	|	ГДЕ
	|		энргДатыОтчетногоПериоды.ПериодНачисления = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачисления, СЕКУНДА, -1), МЕСЯЦ)
	|		И энргДатыОтчетногоПериоды.Организация = &Организация) КАК ВложенныйЗапрос
	|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.энргДеньЗавершенияРасчетногоПериода КАК энргДеньЗавершенияРасчетногоПериода
	|		ПО (ИСТИНА)";
	результат = Запрос.Выполнить();
	Выборка  = результат.Выбрать();
	Выборка.Следующий();
	Структура = Новый Структура("ПериодНачисления,НачалоОП,ЗавершениеОП", Выборка.ПериодНачисления,Выборка.НачалоОП,Выборка.ЗавершениеОП);
	
	Возврат Структура;
КонецФункции

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

#Область РАССЧИТАТЬ_ДОСЧИТАННЫЙ_ОБЪЕМ

&НаСервере
Процедура РассчитатьНаСервере()
	РезультатЗапроса 	= ЗаполнитьЗначенияТемператур();
	ТекСтрока			= РезультатЗапроса.Выбрать();
	
	НачисленияПоТочкам 								= Новый Соответствие;

	
	Пока ТекСтрока.Следующий() Цикл
		ТекНомерСтроки				= ТекСтрока.НомерСтроки;
		ОбъемДосчитанный        	= 0;
		ОбъемИтоговый        		= 0;
		ТемпВоздухаВнутриПомещения	= ТекСтрока.ТемператураКатегорииОбъекта;
		ФактСредМесТемпНаружВоздуха	= ТекСтрока.СреднемесячнаяТемпература;
		ПроектТемпНаружВоздуха		= ТекСтрока.ПроектнаяТемпература;	
		Коэффициент				= (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ПроектТемпНаружВоздуха);

		НачисленияПоУслуге 			= Новый Соответствие;
		
		КолвоНештатнойРаботыЧас 	= ТекСтрока.КоличествоЧасовРаботыТУ - ТекСтрока.КоличествоЧасовШтатнойРаботыПУ;
		Если ТекСтрока.СодержитПотери  Тогда
			
			Если КолвоНештатнойРаботыЧас <= 360 Тогда
				ОбъемДосчитанный        = 0;
				ОбъемИтоговый			= 0;
			Иначе 
				Если ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
					ОбъемДосчитанный        = ТекСтрока.ДоговорнойОбъем;
				ИначеЕсли ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке Тогда
					ОбъемДосчитанный        = ТекСтрока.ЗначениеНагрузки * ТекСтрока.КоличествоЧасовРаботыТУ  *Коэффициент;
				Иначе
					ОбъемДосчитанный        = 0;
				КонецЕсли;
				
				ОбъемИтоговый = ОбъемДосчитанный;
			КонецЕсли;
		ИначеЕсли КолвоНештатнойРаботыЧас = 0 Тогда
			ОбъемДосчитанный			= 0;
			ОбъемИтоговый				= ТекСтрока.Объем;
			
		ИначеЕсли ТекСтрока.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоСреднесуточномуКоличествуТепловойЭнергии Тогда
			
			КолвоТепловойЭнергии 	= 0;
			
			Если КолвоНештатнойРаботыЧас <= 360 Тогда
				
				ТемпературныйКоэффициент	= (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха);
				КолвоТепловойЭнергии		= ТекСтрока.Объем;									
				ОбъемДосчитанный       	 	= КолвоТепловойЭнергии / ТекСтрока.КоличествоЧасовШтатнойРаботыПУ * КолвоНештатнойРаботыЧас * ТемпературныйКоэффициент;
				ОбъемИтоговый				= ОбъемДосчитанный + ТекСтрока.Объем;
				
			Иначе 
				
				Если ТекСтрока.ОбъемУслугиПред <> 0 Тогда
					ТемпературныйКоэффициент				= (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ТекСтрока.СреднемесячнаяТемператураПред);
					ОбъемДосчитанный        = ТекСтрока.ОбъемУслугиПред / ТекСтрока.КоличествоЧасовРаботыТУ *  ТекСтрока.КоличествоЧасовШтРаботыПред * ТемпературныйКоэффициент;
				Иначе
					ТемпературныйКоэффициент				= (ТемпВоздухаВнутриПомещения - ФактСредМесТемпНаружВоздуха) / (ТемпВоздухаВнутриПомещения - ПроектТемпНаружВоздуха);
					КолвоТепловойЭнергии	= ТекСтрока.ЗначениеНагрузки;				
					ОбъемДосчитанный        = КолвоТепловойЭнергии * ТекСтрока.КоличествоЧасовРаботыТУ * ТемпературныйКоэффициент;
					
				КонецЕсли;
				ОбъемИтоговый			= ОбъемДосчитанный;
			КонецЕсли;	
			
		ИначеЕсли ТекСтрока.СпособДосчётаРесурса = Перечисления.бестСпособыДосчётаРесурса.ПоФактическомуРасходуЗаПредыдущийПериод Тогда
			
			КолвоТепловойЭнергии 			= 0;
			Коэффициент						= 1;
			
			Если КолвоНештатнойРаботыЧас <= 720 И ТекСтрока.ОбъемУслугиПред <> 0 Тогда
				Если ЗначениеЗаполнено(ТекСтрока.ЗависитОтУслуги) И ТекСтрока.Приоритет = 0 Тогда
					ОбъемДосчитанный        = ТекСтрока.ОбъемУслугиПред / ТекСтрока.КоличествоЧасовШтРаботыПред * ТекСтрока.КоличествоЧасовРаботыТУ;
				Иначе
					ОбъемТЭПред				= ТекСтрока.ОбъемЗависимойУслугиПред / ТекСтрока.КоличествоЧасовШтРаботыПредЗависимойУслуги * ТекСтрока.КоличествоЧасовРаботыТУ;			
					ОбъемДосчитанный        = ОбъемТЭПред / (ТекСтрока.ТемпПодачиИсточника - ТекСтрока.ТемпХВИсточника) * 1000;
				КонецЕсли;	
				ОбъемИтоговый				= ОбъемДосчитанный;
				
			Иначе					
				Если ЗначениеЗаполнено(ТекСтрока.ЗависитОтУслуги) И ТекСтрока.Приоритет = 0 Тогда
					Если ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ДоговорнаяВеличина Тогда
						ОбъемДосчитанный        = ТекСтрока.ДоговорнойОбъем;
					ИначеЕсли ТекСтрока.СпособРасчетаНорматива = Перечисления.бестТипыНачисленияПоНормативуНП.ПоНагрузке Тогда
						ОбъемДосчитанный        = ТекСтрока.ЗначениеНагрузки * ТекСтрока.КоличествоЧасовРаботыТУ;
					Иначе
						ОбъемДосчитанный        = 0;
					КонецЕсли;
				Иначе
					
					Если НЕ НачисленияПоТочкам[ТекСтрока.ТочкаУчета] = Неопределено Тогда
						Если НЕ НачисленияПоТочкам[ТекСтрока.ТочкаУчета][ТекСтрока.ЗависитОтУслуги] = Неопределено Тогда
							
							ОбъемУслугиОсновной 						= НачисленияПоТочкам[ТекСтрока.ТочкаУчета][ТекСтрока.ЗависитОтУслуги];
							
							Если ТекСтрока.Услуга.ЗависитОтУслуги = ТекСтрока.ЗависитОтУслуги Тогда
								ОбъемДосчитанный = ОбъемУслугиОсновной * (ТекСтрока.ТемпПодачиИсточника - ТекСтрока.ТемпХВИсточника) / 1000;
							Иначе
								ОбъемДосчитанный = ОбъемУслугиОсновной / (ТекСтрока.ТемпПодачиИсточника - ТекСтрока.ТемпХВИсточника) * 1000;
							КонецЕсли;					
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				ОбъемИтоговый					= ОбъемДосчитанный;
			КонецЕсли;
			
		Иначе 
			ОбъемДосчитанный					= 0;				
		КонецЕсли;	
		
		НачисленияПоУслуге.Вставить(ТекСтрока.Услуга, ОбъемДосчитанный);

		
		НачисленияПоТочкам.Вставить(ТекСтрока.ТочкаУчета, НачисленияПоУслуге);

		
		СтрокаПоНомеру					= Объект.ТочкиУчета[ТекНомерСтроки-1];
		
		СтрокаПоНомеру.ОбъемДосчитанный = ОбъемДосчитанный;
		СтрокаПоНомеру.ОбъемИтоговый 	= ОбъемИтоговый;
		
	КонецЦикла;  	
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗначенияТемператур()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 				Объект.Дата);
	Запрос.УстановитьПараметр("ДатаНачПредМесяц",	НачалоМесяца((ДобавитьМесяц(Объект.Дата,-1))));
	Запрос.УстановитьПараметр("ДатаКонПредМесяц",	КонецМесяца((ДобавитьМесяц(Объект.Дата,-1))));
	Запрос.УстановитьПараметр("Ссылка", 			Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Объект.Организация);
	Запрос.УстановитьПараметр("Район", 				Объект.Район);
	Запрос.УстановитьПараметр("Договор", 			Объект.Договор);
	Запрос.УстановитьПараметр("ПериодНачисления", 	Объект.ПериодНачисления);
	Запрос.УстановитьПараметр("РасчетныйМесяцПред", ДобавитьМесяц(Объект.ПериодНачисления, -1));
	Запрос.УстановитьПараметр("Таблица", 			Объект.ТочкиУчета.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.ОбъектРасчета КАК ОбъектРасчета,
	               |	Таблица.Услуга КАК Услуга,
	               |	&Организация КАК Организация,
	               |	&Район КАК Район,
	               |	&Договор КАК Договор,
	               |	&ПериодНачисления КАК ПериодНачисления,
	               |	Таблица.НомерСтроки КАК НомерСтроки,
	               |	Таблица.ТочкаУчета КАК ТочкаУчета,
	               |	Таблица.Объем КАК Объем,
	               |	Таблица.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	Таблица.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	               |	Таблица.ОбъемДосчитанный КАК ОбъемДосчитанный,
	               |	Таблица.ЗначениеНагрузки КАК ЗначениеНагрузки,
	               |	Таблица.ДоговорнойОбъем КАК ДоговорнойОбъем,
	               |	Таблица.ПриборУчета КАК ПриборУчета
	               |ПОМЕСТИТЬ ВрТ0
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ0.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ0.Услуга КАК Услуга,
	               |	ВрТ0.Организация КАК Организация,
	               |	ВрТ0.Район КАК Район,
	               |	ВрТ0.Договор КАК Договор,
	               |	ВрТ0.ПериодНачисления КАК ПериодНачисления,
	               |	ЕСТЬNULL(бестОбъектыРасчета.КатегорияПомещения, ЗНАЧЕНИЕ(Справочник.энргКатегорииПомещений.ПустаяСсылка)) КАК КатегорияПомещения,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(энргВидыУслуг.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтчетныйПериод)) <> ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтопительныйПериод)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтчетныйПериод)
	               |		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтчетныйПериод))
	               |	КОНЕЦ КАК ВидСезонностУслуги,
	               |	ВрТ0.НомерСтроки КАК НомерСтроки,
	               |	ВрТ0.ТочкаУчета КАК ТочкаУчета,
	               |	ВрТ0.Объем КАК Объем,
	               |	ВрТ0.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	ВрТ0.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	               |	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК ЗависитОтУслуги,
	               |	ЕСТЬNULL(энргВидыУслуг.СпособДосчётаРесурса, ЗНАЧЕНИЕ(перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)) КАК СпособДосчета,
	               |	ВрТ0.ОбъемДосчитанный КАК ОбъемДосчитанный,
	               |	ВрТ0.ЗначениеНагрузки КАК ЗначениеНагрузки,
	               |	ВрТ0.ПриборУчета КАК ПриборУчета,
	               |	ЕСТЬNULL(бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети, ЗНАЧЕНИЕ(Справочник.бестСтруктураСети.ПустаяСсылка)) КАК Источник,
	               |	ВрТ0.ДоговорнойОбъем КАК ДоговорнойОбъем,
	               |	энргВидыУслуг.СодержитПотери КАК СодержитПотери
	               |ПОМЕСТИТЬ ВрТ1
	               |ИЗ
	               |	ВрТ0 КАК ВрТ0
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	               |		ПО ВрТ0.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	               |		ПО ВрТ0.Услуга = энргВидыУслуг.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	               |		ПО ВрТ0.Организация = бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация
	               |			И ВрТ0.Район = бестСтруктураСетиТочекУчетаНПСрезПоследних.Район
	               |			И ВрТ0.ОбъектРасчета = бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета
	               |			И ВрТ0.ТочкаУчета = бестСтруктураСетиТочекУчетаНПСрезПоследних.ТочкаУчета
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ0.ПериодНачисления,
	               |	ВрТ0.Договор,
	               |	ЕСТЬNULL(бестОбъектыРасчета.КатегорияПомещения, ЗНАЧЕНИЕ(Справочник.энргКатегорииПомещений.ПустаяСсылка)),
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(энргВидыУслуг.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтчетныйПериод)) <> ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтопительныйПериод)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтчетныйПериод)
	               |		ИНАЧЕ ЕСТЬNULL(энргВидыУслуг.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ОтчетныйПериод))
	               |	КОНЕЦ,
	               |	ВрТ0.ОбъектРасчета,
	               |	ВрТ0.Услуга,
	               |	ВрТ0.Организация,
	               |	ВрТ0.Район,
	               |	ВрТ0.НомерСтроки,
	               |	ВрТ0.ТочкаУчета,
	               |	ВрТ0.Объем,
	               |	ВрТ0.КоличествоЧасовШтатнойРаботыПУ,
	               |	ВрТ0.КоличествоЧасовРаботыТУ,
	               |	ЕСТЬNULL(энргВидыУслуг.ЗависитОтУслуги, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)),
	               |	ЕСТЬNULL(энргВидыУслуг.СпособДосчётаРесурса, ЗНАЧЕНИЕ(перечисление.бестСпособыДосчётаРесурса.ПустаяСсылка)),
	               |	ВрТ0.ОбъемДосчитанный,
	               |	ВрТ0.ЗначениеНагрузки,
	               |	ВрТ0.ПриборУчета,
	               |	ЕСТЬNULL(бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети, ЗНАЧЕНИЕ(Справочник.бестСтруктураСети.ПустаяСсылка)),
	               |	ВрТ0.ДоговорнойОбъем,
	               |	энргВидыУслуг.СодержитПотери
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.Организация КАК Организация,
	               |	ВрТ1.Район КАК Район,
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемПоПриборуОборот, 0)) КАК ОбъемПоПрибору,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиОборот, 0)) КАК ОбъемУслуги,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемУслугиПотребленныйОборот, 0)) КАК ОбъемУслугиПотребленный,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.КоличествоЧасовШтатнойРаботыПУОборот, 0)) КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	СУММА(ЕСТЬNULL(бестОбъемНачисленийНПОбороты.ОбъемДосчитанныйОборот, 0)) КАК ОбъемДосчитанный,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.ЗависитОтУслуги КАК ЗависитОтУслуги
	               |ПОМЕСТИТЬ ОбъемыЗаПредМесяц
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бестОбъемНачисленийНП.Обороты(
	               |				&ДатаНачПредМесяц,
	               |				&ДатаКонПредМесяц,
	               |				Месяц,
	               |				Организация = &Организация
	               |					И Район = &Район
	               |					И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Начисление)) КАК бестОбъемНачисленийНПОбороты
	               |		ПО ВрТ1.Организация = бестОбъемНачисленийНПОбороты.Организация
	               |			И ВрТ1.Район = бестОбъемНачисленийНПОбороты.Район
	               |			И ВрТ1.Договор = бестОбъемНачисленийНПОбороты.Договор
	               |			И ВрТ1.ТочкаУчета = бестОбъемНачисленийНПОбороты.ТочкаУчета
	               |			И ВрТ1.ОбъектРасчета = бестОбъемНачисленийНПОбороты.ОбъектРасчета
	               |			И ВрТ1.ПриборУчета = бестОбъемНачисленийНПОбороты.ПриборУчета
	               |			И ВрТ1.Услуга = бестОбъемНачисленийНПОбороты.Услуга
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ1.Организация,
	               |	ВрТ1.Район,
	               |	ВрТ1.Договор,
	               |	ВрТ1.ОбъектРасчета,
	               |	ВрТ1.ТочкаУчета,
	               |	ВрТ1.Услуга,
	               |	ВрТ1.ЗависитОтУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСпособНачисленияНормативаНПСрезПоследних.Услуга КАК Услуга,
	               |	бестСпособНачисленияНормативаНПСрезПоследних.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	бестСпособНачисленияНормативаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ СпособыРасчетаНорматива
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестСпособНачисленияНормативаНП.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСпособНачисленияНормативаНПСрезПоследних
	               |		ПО ВрТ1.ОбъектРасчета = бестСпособНачисленияНормативаНПСрезПоследних.ОбъектРасчета
	               |			И ВрТ1.Услуга = бестСпособНачисленияНормативаНПСрезПоследних.Услуга
	               |			И ВрТ1.ТочкаУчета = бестСпособНачисленияНормативаНПСрезПоследних.ТочкаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СпособыРасчетаНорматива.Услуга КАК Услуга,
	               |	СпособыРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	СпособыРасчетаНорматива.ОбъектРасчета КАК ОбъектРасчета,
	               |	СпособыРасчетаНорматива.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	ВЫБОР
	               |		КОГДА СпособыРасчетаНорматива.СпособРасчетаНорматива = ЗНАЧЕНИЕ(Перечисление.бестТипыНачисленияПоНормативуНП.ТемпературныйКоэффициент)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПриоритетСпособаРасчета,
	               |	СпособыРасчетаНорматива.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ПриоритетСпособаРасчетаНорматива
	               |ИЗ
	               |	СпособыРасчетаНорматива КАК СпособыРасчетаНорматива
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ Услуги
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Услуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	Услуги.Договор КАК Договор,
	               |	Услуги.Услуга КАК Услуга,
	               |	Услуги.ЗависитОтУслуги КАК ЗависитОтУслуги,
	               |	Услуги.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ЗависимыеУслуги
	               |ИЗ
	               |	Услуги КАК Услуги
	               |ГДЕ
	               |	Услуги.ЗависитОтУслуги <> ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗависимыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	ЗависимыеУслуги.Договор КАК Договор,
	               |	ЗависимыеУслуги.Услуга КАК Услуга,
	               |	ЗависимыеУслуги.ЗависитОтУслуги КАК ЗависимаяУслуга,
	               |	ЗависимыеУслуги.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ВзаимозависимыеУслуги
	               |ИЗ
	               |	ЗависимыеУслуги КАК ЗависимыеУслуги
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗависимыеУслуги.ОбъектРасчета,
	               |	ЗависимыеУслуги.Договор,
	               |	ЗависимыеУслуги.ЗависитОтУслуги,
	               |	ЗависимыеУслуги.Услуга,
	               |	ЗависимыеУслуги.ТочкаУчета
	               |ИЗ
	               |	ЗависимыеУслуги КАК ЗависимыеУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаимозависимыеУслуги.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВзаимозависимыеУслуги.Договор КАК Договор,
	               |	ВзаимозависимыеУслуги.Услуга КАК Услуга,
	               |	ВзаимозависимыеУслуги.ЗависимаяУслуга КАК ЗависимаяУслуга,
	               |	ПриоритетСпособаРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	ПриоритетСпособаРасчетаНорматива.ПриоритетСпособаРасчета КАК ПриоритетСпособаРасчета,
	               |	ВзаимозависимыеУслуги.ТочкаУчета КАК ТочкаУчета
	               |ПОМЕСТИТЬ ПриоритетРасчетаЗависимыхУслуг
	               |ИЗ
	               |	ВзаимозависимыеУслуги КАК ВзаимозависимыеУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетСпособаРасчетаНорматива КАК ПриоритетСпособаРасчетаНорматива
	               |		ПО ВзаимозависимыеУслуги.ОбъектРасчета = ПриоритетСпособаРасчетаНорматива.ОбъектРасчета
	               |			И ВзаимозависимыеУслуги.Услуга = ПриоритетСпособаРасчетаНорматива.Услуга
	               |			И ВзаимозависимыеУслуги.ТочкаУчета = ПриоритетСпособаРасчетаНорматива.ТочкаУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.Организация КАК Организация,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.Район КАК Район,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.РасчетныйМесяц КАК РасчетныйМесяц,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.ВидПериода КАК ВидПериода,
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.СреднемесячнаяТемпература КАК СреднемесячнаяТемпература
	               |ПОМЕСТИТЬ СреднемесячнаяТемпПредМесяц
	               |ИЗ
	               |	РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха КАК бестСреднемесячнаяТемператураНаружногоВоздуха
	               |ГДЕ
	               |	бестСреднемесячнаяТемператураНаружногоВоздуха.Организация = &Организация
	               |	И бестСреднемесячнаяТемператураНаружногоВоздуха.Район = &Район
	               |	И бестСреднемесячнаяТемператураНаружногоВоздуха.РасчетныйМесяц = &РасчетныйМесяцПред
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТ1.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВрТ1.Услуга КАК Услуга,
	               |	ВрТ1.Организация КАК Организация,
	               |	ВрТ1.Район КАК Район,
	               |	ВрТ1.Договор КАК Договор,
	               |	ВрТ1.ПериодНачисления КАК ПериодНачисления,
	               |	ВрТ1.КатегорияПомещения КАК КатегорияПомещения,
	               |	ВрТ1.ВидСезонностУслуги КАК ВидСезонностУслуги,
	               |	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, 0) КАК ТемператураКатегорииОбъекта,
	               |	ЕСТЬNULL(бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература, 0) КАК СреднемесячнаяТемпература,
	               |	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, 0) КАК ПроектнаяТемпература,
	               |	ВрТ1.ТочкаУчета КАК ТочкаУчета,
	               |	ВрТ1.Объем КАК Объем,
	               |	ВрТ1.КоличествоЧасовШтатнойРаботыПУ КАК КоличествоЧасовШтатнойРаботыПУ,
	               |	ВрТ1.КоличествоЧасовРаботыТУ КАК КоличествоЧасовРаботыТУ,
	               |	ВрТ1.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга, ВрТ1.ЗависитОтУслуги) КАК ЗависитОтУслуги,
	               |	ВрТ1.СпособДосчета КАК СпособДосчётаРесурса,
	               |	ВрТ1.ОбъемДосчитанный КАК ОбъемДосчитанный,
	               |	ЕСТЬNULL(ВрТ1.ЗначениеНагрузки, 0) КАК ЗначениеНагрузки,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяц.КоличествоЧасовШтатнойРаботыПУ, 0) КАК КоличествоЧасовШтРаботыПред,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяц.ОбъемПоПрибору, 0) КАК ОбъемУслугиПред,
	               |	ЕСТЬNULL(бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника, 0) КАК ТемпПодачиИсточника,
	               |	ЕСТЬNULL(бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника, 0) КАК ТемпХВИсточника,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяцЗависимойУслуги.ОбъемПоПрибору, 0) КАК ОбъемЗависимойУслугиПред,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяцЗависимойУслуги.КоличествоЧасовШтатнойРаботыПУ, 0) КАК КоличествоЧасовШтРаботыПредЗависимойУслуги,
	               |	ЕСТЬNULL(ВрТ1ЗависимойУслуги.ЗначениеНагрузки, 0) КАК ЗначениеНагрузкиЗависимойУслуги,
	               |	ЕСТЬNULL(ВрТ1ЗависимойУслуги.ДоговорнойОбъем, 0) КАК ДоговорнойОбъемЗависимойУслуги,
	               |	ЕСТЬNULL(ВрТ1.ДоговорнойОбъем, 0) КАК ДоговорнойОбъем,
	               |	СпособыРасчетаНорматива.СпособРасчетаНорматива КАК СпособРасчетаНорматива,
	               |	ПриоритетРасчетаЗависимыхУслуг.СпособРасчетаНорматива КАК СпособРасчетаНормативаЗависимойУслуги,
	               |	ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ПриоритетСпособаРасчета, 0) КАК Приоритет,
	               |	ВрТ1.СодержитПотери КАК СодержитПотери,
	               |	СреднемесячнаяТемпПредМесяц.СреднемесячнаяТемпература КАК СреднемесячнаяТемператураПред
	               |ИЗ
	               |	ВрТ1 КАК ВрТ1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературыВКатегорияхОбъектов.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестТемпературыВКатегорияхОбъектовСрезПоследних
	               |		ПО ВрТ1.КатегорияПомещения = бестТемпературыВКатегорияхОбъектовСрезПоследних.КатегорияПомещения
	               |			И ВрТ1.Организация = бестТемпературыВКатегорияхОбъектовСрезПоследних.Организация
	               |			И ВрТ1.Район = бестТемпературыВКатегорияхОбъектовСрезПоследних.Район
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСреднемесячнаяТемператураНаружногоВоздуха.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних
	               |		ПО ВрТ1.ПериодНачисления = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.РасчетныйМесяц
	               |			И ВрТ1.ВидСезонностУслуги = бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.ВидПериода
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыЗаПредМесяц КАК ОбъемыЗаПредМесяц
	               |		ПО ВрТ1.ОбъектРасчета = ОбъемыЗаПредМесяц.ОбъектРасчета
	               |			И ВрТ1.ТочкаУчета = ОбъемыЗаПредМесяц.ТочкаУчета
	               |			И ВрТ1.Услуга = ОбъемыЗаПредМесяц.Услуга
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемператураИсточника.СрезПоследних(
	               |				&Дата,
	               |				Организация = &Организация
	               |					И Район = &Район) КАК бестТемператураИсточникаСрезПоследних
	               |		ПО ВрТ1.Организация = бестТемператураИсточникаСрезПоследних.Организация
	               |			И ВрТ1.Район = бестТемператураИсточникаСрезПоследних.Район
	               |			И ВрТ1.Источник = бестТемператураИсточникаСрезПоследних.Источник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыЗаПредМесяц КАК ОбъемыЗаПредМесяцЗависимойУслуги
	               |		ПО ВрТ1.ОбъектРасчета = ОбъемыЗаПредМесяцЗависимойУслуги.ОбъектРасчета
	               |			И ВрТ1.ТочкаУчета = ОбъемыЗаПредМесяцЗависимойУслуги.ТочкаУчета
	               |			И ВрТ1.Услуга = ОбъемыЗаПредМесяцЗависимойУслуги.ЗависитОтУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВрТ1 КАК ВрТ1ЗависимойУслуги
	               |		ПО ВрТ1.ОбъектРасчета = ВрТ1ЗависимойУслуги.ОбъектРасчета
	               |			И ВрТ1.ТочкаУчета = ВрТ1ЗависимойУслуги.ТочкаУчета
	               |			И ВрТ1.Услуга = ВрТ1ЗависимойУслуги.ЗависитОтУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаНорматива КАК СпособыРасчетаНорматива
	               |		ПО ВрТ1.ОбъектРасчета = СпособыРасчетаНорматива.ОбъектРасчета
	               |			И ВрТ1.Услуга = СпособыРасчетаНорматива.Услуга
	               |			И ВрТ1.ТочкаУчета = СпособыРасчетаНорматива.ТочкаУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПриоритетРасчетаЗависимыхУслуг КАК ПриоритетРасчетаЗависимыхУслуг
	               |		ПО ВрТ1.ОбъектРасчета = ПриоритетРасчетаЗависимыхУслуг.ОбъектРасчета
	               |			И ВрТ1.Услуга = ПриоритетРасчетаЗависимыхУслуг.Услуга
	               |			И ВрТ1.ТочкаУчета = ПриоритетРасчетаЗависимыхУслуг.ТочкаУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СреднемесячнаяТемпПредМесяц КАК СреднемесячнаяТемпПредМесяц
	               |		ПО ВрТ1.ВидСезонностУслуги = СреднемесячнаяТемпПредМесяц.ВидПериода,
	               |	РегистрСведений.бестРасчетнаяТемператураНаружногоВоздухаДляПроектирования.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И Район = &Район) КАК бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВрТ1.ОбъектРасчета,
	               |	ВрТ1.ПериодНачисления,
	               |	ВрТ1.Район,
	               |	ВрТ1.Договор,
	               |	ВрТ1.ВидСезонностУслуги,
	               |	ВрТ1.КатегорияПомещения,
	               |	ВрТ1.Организация,
	               |	ВрТ1.Услуга,
	               |	ЕСТЬNULL(бестТемпературыВКатегорияхОбъектовСрезПоследних.ТемператураОптимальная, 0),
	               |	ЕСТЬNULL(бестСреднемесячнаяТемператураНаружногоВоздухаСрезПоследних.СреднемесячнаяТемпература, 0),
	               |	ЕСТЬNULL(бестРасчетнаяТемператураНаружногоВоздухаДляПроектированияСрезПоследних.ПроектнаяТемпература, 0),
	               |	ВрТ1.ТочкаУчета,
	               |	ВрТ1.Объем,
	               |	ВрТ1.КоличествоЧасовШтатнойРаботыПУ,
	               |	ВрТ1.КоличествоЧасовРаботыТУ,
	               |	ВрТ1.НомерСтроки,
	               |	ВрТ1.СпособДосчета,
	               |	ВрТ1.ОбъемДосчитанный,
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяц.КоличествоЧасовШтатнойРаботыПУ, 0),
	               |	ЕСТЬNULL(бестТемператураИсточникаСрезПоследних.ТемператураПодачиИсточника, 0),
	               |	ЕСТЬNULL(бестТемператураИсточникаСрезПоследних.ТемператураХолоднойВодыИсточника, 0),
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяц.ОбъемПоПрибору, 0),
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяцЗависимойУслуги.ОбъемПоПрибору, 0),
	               |	ЕСТЬNULL(ОбъемыЗаПредМесяцЗависимойУслуги.КоличествоЧасовШтатнойРаботыПУ, 0),
	               |	ЕСТЬNULL(ВрТ1ЗависимойУслуги.ЗначениеНагрузки, 0),
	               |	ЕСТЬNULL(ВрТ1ЗависимойУслуги.ДоговорнойОбъем, 0),
	               |	ЕСТЬNULL(ВрТ1.ЗначениеНагрузки, 0),
	               |	ЕСТЬNULL(ВрТ1.ДоговорнойОбъем, 0),
	               |	СпособыРасчетаНорматива.СпособРасчетаНорматива,
	               |	ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ПриоритетСпособаРасчета, 0),
	               |	ПриоритетРасчетаЗависимыхУслуг.СпособРасчетаНорматива,
	               |	ЕСТЬNULL(ПриоритетРасчетаЗависимыхУслуг.ЗависимаяУслуга, ВрТ1.ЗависитОтУслуги),
	               |	ВрТ1.СодержитПотери,
	               |	СреднемесячнаяТемпПредМесяц.СреднемесячнаяТемпература
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет,
	               |	НомерСтроки";
	Результат = Запрос.Выполнить();
	
	Возврат Результат;	
КонецФункции

#КонецОбласти

#КонецОбласти
